<?php

$mainValues = [
    'banned' => 'حساب شما مسدود شد',
    'customer_custome_plan_day' => "|لطفا  تعداد روز اشتراکت رو وارد کنید\n|هزینه هر روز: DAY-PRICE",
    'customer_custome_plan_volume'=>"|لطفا مقدار گیگابایت سرویست رو وارد کنید\n|هزینه هر گیگ: VOLUME-PRICE",
    'customer_custome_plan_name'=>'اسم کانفیگ را وارد کنید ( حروف کوچیک انگلیسی و عدد باهم وارد کنید مثال: test27)',
    'send_user_id'=>"آیدی عددی کاربر رو بفرست :",
    'enter_decrease_amount'=>"مبلغی که میخوای ازش کم کنیدی رو وارد کنید:",
    'enter_increase_amount'=>"مبلغی که میخوای بهش بدی رو وارد کنید:",
    'user_not_found'=>"همچین کسی رو نداریم",
    'amount_decreased_from_your_wallet'=> "مبلغ AMOUNT تومان از حساب شما کم شد",
    'amount_decreased_from_user_wallet'=>"مبلغ AMOUNT تومان از کیف پول کاربر مورد نظر کم شد",
    'increase_wallet_cart_to_cart'=>"یه تصویر از فیش واریزی برام ارسال کنید :

 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME

 بعد از اینکه پرداخت تایید شد مبلغ مورد نظر به کیف پولت اضافه میشود!",
    'order_increase_sent'=>" سفارش شما با موفقیت ثبت شد.
    بعد از تایید به کیف پولت اضافه میشود ... ",
    'please_send_only_image'=>"لطفا فقط عکس ارسال کنید",
    'reached_main_menu'=>"خب برگشتم عقب اگه کاری داری بگو اگه خواستی یکی از گزینه هارو انتخاب کنید که کارتو انجام بدم

• /start",
    'increase_wallet_request_message'=>" درخواست ( افزایش موجودی )

• مبلغ: PRICE تومان
• نام و نام خانوادگی : NAME
• یوزرنیم : @USERNAME
• کد کاربری : <code>USER-ID</code>
",
    'out_of_connection_capacity'=>'ظرفیت این کانکشن پر شده است',
    'out_of_server_capacity'=>'ظرفیت این سرور پر شده است',
    'can_create_specific_account'=> "روی این پلن فقط AMOUNT اکانت میشود ساخت",
    'buy_account_cart_to_cart'=>" یه تصویر از فیش واریزی یا شماره پیگیری -  ساعت پرداخت - نام پرداخت کننده را در یک پیام ارسال کنید :

 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME

 بعد از اینکه پرداخت تایید شد ( لینک سرور ) به صورت خودکار از طریق همین ربات برای شما ارسال میشود",
    'renew_ccount_cart_to_cart'=>"  یه تصویر از فیش واریزی یا شماره پیگیری -  ساعت پرداخت - نام پرداخت کننده را در یک پیام برام ارسال کنید :

 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME",
    'order_buy_sent'=>" سفارش شما با موفقیت ثبت شد.
بعد از تایید برای شما ارسال میشود ... ",
    'buy_custom_account_request'=>" خرید پلن دلخواه ( TYPE )
    
• آیدی کاربر: USER-ID
• اسم کاربر: <a href='tg://user?id=USER-ID'>NAME</a>
• نام کاربری: @USERNAME
• مبلغ پرداختی: PRICE تومان
• نام سرویس: REMARK
• حجم سرویس: VOLUME گیگ
• مدت سرویس: DAYS روز",
'buy_new_account_request'=>"| خرید جدید ( TYPE )

• آیدی کاربر: USER-ID
• اسم کاربر: NAME
• نام کاربری: USERNAME
• مبلغ پرداختی: PRICE تومان
•سرور: SERVERNAME
• نام سرویس: REMARK
• حجم سرویس: VOLUME گیگ
• مدت سرویس: DAYS روز",
'buy_new_much_account_request'=>"| خرید جدید ( TYPE )

• آیدی کاربر: USER-ID
• اسم کاربر: NAME
• نام کاربری: USERNAME
• مبلغ پرداختی: PRICE تومان
• تعداد اکانت: ACCOUNT-COUNT
• نام سرویس: REMARK",
'invite_buy_new_account'=>" خرید ( زیر مجموعه )

• آیدی کاربر: USER-ID
• اسم کاربر: NAME
• نام کاربری: USERNAME
• مبلغ پرداختی: PRICE تومان
• نام سرویس: REMARK
• سفارش: FILENAME",
    'renew_order_sent'=>"درخواست شما با موفقیت ثبت شد، بعد از بررسی و تایید ادمین کانفیگ را برای شما میفرستم ممنون از صبوری شما 
    
• /start",
'renew_account_request_message'=>" تمدید سرویس ( TYPE )

• آیدی کاربر: USER-ID
• اسم کاربر: NAME
• نام کاربری: USERNAME
• مبلغ پرداختی: PRICE تومان
• نام سرویس: REMARK
• حجم سرویس: VOLUME گیگ
• مدت سرویس: DAYS روز",
'increase_account_request_message'=>" درخواست افزایش ( TYPE سرویس )

• آیدی کاربر: USER-ID
• اسم کاربر: NAME
• نام کاربری: USERNAME
• نام سرویس: REMARK
TYPE افزایش: INCREASE گیگ/روز
قیمت: PRICE تومان",
    'waiting_message'=>'در حال انتظار ...',
    'join_channel_message'=>"برای استفاده از ربات حتما باید در کانال زیر عضو شوید:
    
بعد از اینکه عضو شدید روی دکمه عضو شدم بزنید

",
    'bot_is_updating'=> "ربات در حال بروزرسانی می باشد ...",
    'select_one_to_show_detail'=> 'یکی از سرویس ها را انتخاب کنید',
    'you_dont_have_config'=>'شما هیچ سفارشی ندارید، یک سرویس خرداری کنید',
    'no_order_found'=> "موردی یافت نشد",
    'config_details_message'=>"وضعیت کانفیگ: STATE
    
• نام کانفیگ : NAME

• لینک اتصال: CONNECT-LINK

• لینک سابسکریبشن: SUB-LINK
⁮⁮ ⁮⁮ ⁮⁮ ⁮⁮
",
    'please_wait_message'=>"لطفا منتظر باشید",
    'send_only_number'=> "فقط اعداد انگلیسی ارسال کنید",
    'change_bot_settings_message'=>'هر گزینه ای که میخوای رو خاموش کن',
    'saved_successfuly'=>"با موفقیت ذخیره شد",
    'invited_user_joined_message'=>"تبریک یه نفر با لینک شما وارد ربات شد",
    'please_select_from_below_buttons'=>"لطفا فقط از کلید زیر استفاده کنید",
    'use_iranian_number_only'=>"لطفا فقط با شماره ایرانی اقدام کنید",
    'phone_confirmed'=>"شماره شما با موفقیت تأیید شد",
    'send_your_phone_number'=>"برای استفاده از ربات شماره تماس خود را با استفاده از کلید زیر ارسال کنید",
    'start_message'=>'به ربات خوش اومدی 
     

• کیفیت در اتصال
• برقرای امنیت در ارتباط شما
• پشتیبانی تا روز آخر 

• /start',
    'new_member_joined'=>"یک کاربر جدید عضو ربات شد:

نام: FULLNAME
نام کاربری: @USERNAME
آیدی عددی: USERID

ارسال پیام به کاربر ",
    "not_joine_yet"=>"هنوز عضو کانال نشدید",
    'insert_discount_code'=>"کد تخفیف خورد را وارد کنید:",
    "not_valid_discount_code"=>"کد تخفیفی که وارد کردید معتبر نیست",
    'valid_discount_code'=>"کد تخفیف با موفقیت استفاده شد
مقدار تخفیف AMOUNT تومان",
'used_discount_code'=>"کد تخفیف استفاده شد

• آیدی کاربر: USERID
• اسم کاربر: NAME
• نام کاربری: USERNAME
• کد تخفیف: DISCOUNTCODE
• مقدار تخفیف: AMOUNT تومان
⁮⁮ ⁮⁮",
"send_config_uuid"=>"لینک یکی از کانفیگ ها یا uuid خود را وارد کنید",
'not_correct_text'=>"متن وارد شده معتبر نمی باشد",
'receving_information'=>"در حال دریافت جزییات ... ",
'request_agency_message'=>"درخواست نمایندگی

• آیدی کاربر: USERID
• اسم کاربر: NAME
• نام کاربری: USERNAME
⁮⁮ ⁮⁮",
    'agency_request_sent'=>"درخواست شما با موفقیت ارسال شد، لطفا منتظر باشید",
    'agency_request_already_sent'=>"درخواست شما قبلاً ارسال شده، لطفا منتظر باشید",
    'agency_request_declined'=>" درخواست شما برای نمایندگی رد شد",
    'agency_request_approved'=>" درخواست شما برای نمایندگی تأیید شد",
    'send_agent_discount_percent' =>"لطفا مقدار تخفیف این نمایندگی را به صورت درصد وارد کنید، مثلا 10",
    'agent_setting_message' =>"نماینده:

از این بخش میتوانید خرید تکی و خرید انبوه داشته باشید و همچنین کانفیگ های خریداری شده را مدیریت کنید",
    'selling_is_off'=>"فروش غیرفعال است",
    'no_server_available'=>" هیچ سرور فعالی نداریم لطفا بعدا مجدد تست کنید",
    'buy_sub_select_location' => 'مرحله یک:

گزینه مدنظر خود را برای خرید انتخاب کنید:',
    'the_bot_in_not_admin' => "ربات هنوز در کانال عضو نشده، اول ربات رو در کانال ادمین کنید و ایدی ربات را ارسال کنید ",
    'category_not_avilable'=>"هیچ دسته بندی برای این سرور وجود ندارد",
    'receive_categories'=>"دریافت دسته بندی ...",
    'buy_sub_select_category'=> "مرحله دوم:

دسته بندی مورد نظر خورد را انتخاب کنید",
    'no_plan_available'=>"پلنی در این دسته بندی وجود ندارد",
    'receive_plans'=>"در حال دریافت لیست پلن ها ...",
    'buy_sub_select_plan'=> "مرحله سه:

یکی از پلن ها را انتخاب کنید", 
    'buy_custom_plan'=>'پلن دلخواه خودت رو بخر',
    'select_one_plan_to_edit'=>"یکی از پلن ها را برای ویرایش انتخاب کنید", 
    'enter_account_amount' => " تعداد اکانت درخواستی را وارد کنید حداکثر هربار 6 عدد:

 نکته: در صورت وارد کردن به مقدار بالا احتمالا اکانت ساخته نشود و پنل x-ui گیر کند",
    'send_positive_number'=>"لطفا عددی بزرگتر از 0 وارد کنید",
    'buy_subscription_detail'=>"نام پلن: PLAN-NAME
        ➖➖➖➖➖➖➖
         قیمت پنل : PRICE
        ➖➖➖➖➖➖➖
         توضیحات :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    'buy_much_subscription_detail'=>" نام پلن: PLAN-NAME
        تعداد اکانت: ACCOUNT-COUNT
        قیمت پنل: PRICE
        ➖➖➖➖➖➖➖
         قیمت کل : TOTAL-PRICE
        ➖➖➖➖➖➖➖
         توضیحات :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    'buy_custom_subscription_detail'=>" نام پلن: PLAN-NAME
        حجم اختصاصی: VOLUME GB
        مدت اختصاصی: DAYS روز
        ➖➖➖➖➖➖➖
         قیمت پنل : PRICE
        ➖➖➖➖➖➖➖
         توضیحات :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    "agents_list" => " لیست نمایندگان:

جهت مشاده آمار فروش نمایندگان روی اسم نماینده کلیک کنید، همچنین میتوانید برای نماینده درصد تعیین کنید یا آن را از لیست نمایندگان خارج کنید",
    'agent_deleted_successfuly'=>"نمایندگی با موفقیت حذف شد",
    'agent_details'=>'اطلاعات نماینده AGENT-NAME

سمت راست درآمد و سمت چپ تعداد خرید نماینده می باشد',
    'send_config_remark'=>"لطفا ریمارک کانفیگ را وارد کنید",
    'forward_your_message'=>"لطفا پیام مورد نظر خود را به ربات فروارد کنید",
    "enter_ticket_title"=>"لطفا موضوع تیکت را ارسال کنید!",
    "enter_ticket_description"=> "لطفا متن و یا عکس تیکت را بصورت ساده و مختصر ارسال کنید!",
    "sent_config_to_user"=> '✅ کانفیگ و براش ارسال کردم
ریمارک: REMARK
حجم سرویس: VOLUME گیگ
مدت زمان سرویس: DAYS روز',
    "renewed_config_to_user"=> '✅ کانفیگ و براش تمدید کردم
ریمارک: REMARK
حجم سرویس: VOLUME گیگ
مدت زمان سرویس: DAYS روز',
    'sending_config_to_user'=>'🚀 |  در حال ارسال کانفیگ به مشتری ...',
    'config_not_found'=>"مشکلی پیش اومده، دوباره از نو انجام بده",
    'incorrect_config_name'=>"😡|اسم وارد شده معتبر نمی باشد",
    'pay_with_tron_wallet'=>"  مبلغ AMOUNT ترون رو به والت زیر ارسال کنید و تکسید آیدی واریزی ترون رو برام ارسال کنید :

 <code>TRON-WALLET</code>",
    'incorrect_tax_id'=>"تکسید آیدی وارد شده نامعتبر است",
    'used_tax_id'=>"این تکسید آیدی قبلا استفاده شده است",
    'in_review_tax_id'=>"تراکنیدش شما در صف بررسی قرار گرفت",
    'user_taxid_rejected'=>"تراکنیدش ناموفق TYPE (ترون)
    
آیدی کاربر: USERID
اسم: NAME
یوزرنیم: USERNAME

تکسید آیدی: TAXID

<b>بعد از 5 تلاش رد گردید</b>",
    'your_taxid_rejected'=>"تراکنیدش TYPE شما با تکسید آیدی: TAXID

<b>بعد از 5 تلاش رد شد</b>",
    'incorrect_user_taxid_rejected'=>"تراکنیدش ناموفق TYPE (ترون)
    
آیدی کاربر: USERID
اسم: NAME
یوزرنیم: USERNAME

تکسید آیدی: TAXID

<b>به دلیل ثبت تراکنیدش نادرست رد شد</b>",
    'your_incorrect_taxid_rejected'=>"تراکنیدش TYPE شما با تکسید آیدی: TAXID

<b>به دلیل ثبت تراکنیدش نادرست رد شد</b>",
    'partially_paid_user_taxid'=>"تراکنیدش ناموفق TYPE (ترون)
    
آیدی کاربر: USERID
اسم: NAME
یوزرنیم: USERNAME

تکسید آیدی: TAXID

<b>به دلیل عدم مطابقت مبلغ تراکنیدش رد شد</b>",
    'you_have_partially_paid'=>"تراکنیدش TYPE شما با تکسید آیدی: TAXID

<b>به دلیل عدم مطابقت مبلغ تراکنیدش رد شد</b>",
    'agent_discount_settings'=>"مدیریت تخفیف های نماینده AGENT-NAME"
];

$buttonValues = [
    'bot_reports'=>"📉 آمار کلی ربات",
    'message_to_user'=>"📞 پیام خصوصی",
    'user_reports'=>"🔑 اطلاعات کاربر",
    'admins_list'=>"👤 لیست ادمین ها",
    'increase_wallet'=>"💵 افزایش موجودی",
    'decrease_wallet'=>" کاهش موجودی",
    'create_account'=>"⌨️ ایجاد اکانت انبوه",
    'ban_user'=>"❌ مسدود کردن کاربر",
    'unban_user'=>"✅ آزاد کردن کاربر",
    'server_settings'=>'•مدیریت و تنظیمات سرورها',
    'categories_settings'=>'🗂 مدیریت دسته ها',
    'plan_settings'=>'🪣 مدیریت پلن ها',
    'discount_settings'=>"🎁 مدیریت تخفیف ها",
    'main_button_settings'=>"🕹 مدیریت دکمه ها ",
    'gateways_settings'=>' تنظیمات درگاه و کانال',
    'bot_settings'=>'⚙️ تنظیمات ربات',
    'tickets_list'=>'📪 تیکت ها',
    'message_to_all'=>"📨 ارسال پیام همگانی",
    'forward_to_all'=>"📨 فروارد پیام همگانی",
    'back_to_main'=>'⤵️ برگرد به منوی اصلی ',  
    'cart_to_cart'=>" کارت به کارت",
    'now_payment_gateway'=>" درگاه NowPayment",
    'zarinpal_gateway'=> " درگاه زرین پال",
    'nextpay_gateway'=>" درگاه نکست پی",
    'weswap_gateway'=>" درگاه ارزی ریالی",
    'approve' => 'تایید ✅',
    'approved' => 'تایید شد',
    'decline' => 'عدم تایید ❌',
    'declined' => 'رد شد',
    'back_button'=> "برگشت 🔙",
    'renew_connection_link'=>"🚷 قطع دسترسی و لینک جدید",
    'update_config_connection'=>"⌛️ بروزرسانی کانفیگ",
    'increase_config_volume'=>"🩸 افزایش حجم سرویس",
    'increase_config_days'=>"📆 افزایش زمان سرویس",
    'renew_config'=>'♻ تمدید سرویس',
    'change_config_location'=>'🌎 تغییر لوکیشن',
    'selected_protocol'=>"• پروتکل انتخابی",
    'volume_left'=>" حجم باقیمانده:",
    'expire_date'=>"  تاریخ انقضاء: ",
    'buy_date'=>"  تاریخ خرید: ",
    'plan_name'=>" 🚀 نام پلن:",
    'on'=>"روشن ✅",
    'off'=>"خاموش ❌",
    'active'=>"فعال 🟢",
    'deactive'=>"غیر فعال 🔴",
    'send_phone_number'=>'☎️ ارسال شماره',
    'send_message_to_user'=>"✉️ ارسال پیام به کاربر ",
    'cancel' => '😪 منصرف شدم بیخیال',
    'join_channel'=>"عضویت در کانال",
    'have_joined'=>"عضو شدم ✅",
    'gift_volume_day'=>"• هدیه حجم و زمان",
    'test_account'=>"🎁 دریافت اکانت تست ",
    'invite_friends'=>"🏆 زیر مجموعه گیری",
    'my_info'=>"🧑‍💼 حساب کاربری",
    'my_subscriptions'=>'📱 کانفیگ های من',
    'buy_subscriptions'=>'🛒  خرید کانفیگ جدید',
    'shared_existence'=>"❕ موجودی اشتراکی ",
    'individual_existence'=>" موجودی اختصاصی ",
    'application_links'=>'🧩 آموزش اتصال',
    'my_tickets'=>"📨 تیکت های من",
    'search_config'=>"🪫 مشخصات کانفیگ",
    'delete_config'=>"❌ حذف کانفیگ",
    'pay_with_wallet' => "پرداخت با موجودی",
    'request_agency' =>"🧑‍💼 درخواست نمایندگی 🧑‍💼",
    'agency_setting' =>"➰ پنل همکاری ➰",
    'agent_one_buy'=>"➕ خرید تکی",
    'agent_much_buy'=>"♾ خرید انبوه",
    'agent_bought_accounts'=>"تعداد خرید",
    'agent_joined_date'=>"تاریخ عضویت",
    'agent_agency_date'=>"تاریخ نمایندگی",
    "agent_list"=>"  مدیریت نمایندگان ",
    'search_agent_config'=>"جستجوی کانفیگ",
    'search_admin_config'=>"جستجوی کانفیگ کاربر",
    'sharj'=>"✅  ارسال رسید - شارژ کیف پول",
    "qr_config"=>"🔳 کیو آر کانفیگ",
    "qr_sub"=>"🔳 کیو آر ساب",
    'start_bot'=>"شروع ربات",
    'enable_config'=>"فعال سازی کانفیگ",
    'disable_config'=>"غیر فعال سازی کانفیگ",
    "tron_gateway"=>"درگاه ترون",
    'plan_discount'=>"روی پلن",
    'server_discount'=>"روی سرور"
];
?>
